#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
data.juju_offer.ca_certificate: Reading...
data.juju_offer.database: Reading...
data.juju_offer.ingress: Reading...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # juju_integration.hydra_login_ui_ui_info will be created
  + resource "juju_integration" "hydra_login_ui_ui_info" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint = "ui-endpoint-info"
          + name     = "hydra"
        }
      + application {
          + endpoint = "ui-endpoint-info"
          + name     = "login_ui"
        }
    }

  # juju_integration.kratos_hydra_info will be created
  + resource "juju_integration" "kratos_hydra_info" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint = "hydra-endpoint-info"
          + name     = "hydra"
        }
      + application {
          + endpoint = "hydra-endpoint-info"
          + name     = "kratos"
        }
    }

  # juju_integration.kratos_login_ui_info will be created
  + resource "juju_integration" "kratos_login_ui_info" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint = "kratos-info"
          + name     = "kratos"
        }
      + application {
          + endpoint = "kratos-info"
          + name     = "login_ui"
        }
    }

  # juju_integration.kratos_login_ui_ui_info will be created
  + resource "juju_integration" "kratos_login_ui_ui_info" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint = "ui-endpoint-info"
          + name     = "kratos"
        }
      + application {
          + endpoint = "ui-endpoint-info"
          + name     = "login_ui"
        }
    }

  # juju_integration.login_ui_hydra_info will be created
  + resource "juju_integration" "login_ui_hydra_info" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint = "hydra-endpoint-info"
          + name     = "hydra"
        }
      + application {
          + endpoint = "hydra-endpoint-info"
          + name     = "login_ui"
        }
    }

  # juju_offer.kratos_info_offer will be created
  + resource "juju_offer" "kratos_info_offer" {
      + application_name = "kratos"
      + endpoints        = [
          + "kratos-info",
        ]
      + id               = (known after apply)
      + model            = "identity-platform"
      + name             = "kratos-info-offer"
      + url              = (known after apply)
    }

  # module.hydra.juju_application.hydra will be created
  + resource "juju_application" "hydra" {
      + config      = {}
      + constraints = ""
      + id          = (known after apply)
      + machines    = (known after apply)
      + model       = "identity-platform"
      + model_type  = (known after apply)
      + name        = "hydra"
      + placement   = (known after apply)
      + principal   = (known after apply)
      + storage     = (known after apply)
      + trust       = true
      + units       = 1

      + charm {
          + base     = "ubuntu@22.04"
          + channel  = "latest/edge"
          + name     = "hydra"
          + revision = (known after apply)
          + series   = (known after apply)
        }
    }

  # module.hydra.juju_offer.oauth_offer will be created
  + resource "juju_offer" "oauth_offer" {
      + application_name = "hydra"
      + endpoints        = [
          + "oauth",
        ]
      + id               = (known after apply)
      + model            = "identity-platform"
      + name             = "oauth-offer"
      + url              = (known after apply)
    }

  # module.kratos.juju_application.kratos will be created
  + resource "juju_application" "kratos" {
      + config      = {}
      + constraints = ""
      + id          = (known after apply)
      + machines    = (known after apply)
      + model       = "identity-platform"
      + model_type  = (known after apply)
      + name        = "kratos"
      + placement   = (known after apply)
      + principal   = (known after apply)
      + storage     = (known after apply)
      + trust       = true
      + units       = 1

      + charm {
          + base     = "ubuntu@22.04"
          + channel  = "latest/edge"
          + name     = "kratos"
          + revision = (known after apply)
          + series   = (known after apply)
        }
    }

  # module.login_ui.juju_application.login_ui will be created
  + resource "juju_application" "login_ui" {
      + config      = {}
      + constraints = ""
      + id          = (known after apply)
      + machines    = (known after apply)
      + model       = "identity-platform"
      + model_type  = (known after apply)
      + name        = "login_ui"
      + placement   = (known after apply)
      + principal   = (known after apply)
      + storage     = (known after apply)
      + trust       = true
      + units       = 1

      + charm {
          + base     = "ubuntu@22.04"
          + channel  = "latest/edge"
          + name     = "identity-platform-login-ui-operator"
          + revision = (known after apply)
          + series   = (known after apply)
        }
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + oauth_offer_url = (known after apply)

```

</details>

*Pusher: @renovate[bot], Action: `pull_request`, Working Directory: ``, Workflow: `Pull Request`*